//**********************************************************************
//**********************************************************************
//**                                                                  **
//**        (C)Copyright 1985-2016, American Megatrends, Inc.         **
//**                                                                  **
//**                       All Rights Reserved.                       **
//**                                                                  **
//**      5555 Oakbrook Parkway, Suite 200, Norcross, GA 30093        **
//**                                                                  **
//**                       Phone: (770)-246-8600                      **
//**                                                                  **
//**********************************************************************
//**********************************************************************

//**********************************************************************
// $Header: $
//
// $Revision: $
//
// $Date: $
//**********************************************************************
// Revision History
// ----------------
// $Log: $
// 
//**********************************************************************
//<AMI_FHDR_START>
//
// Name: PciBus.UNI
//
// Description: Generic PCI Form String Definitions.
//
//<AMI_FHDR_END>
//**********************************************************************
/=#
#include "VFR.uni"

#string STR_ROM_PCI_DRIVER_VER_PROMPT   #language eng "AMI ROM Dispatch Policy : "
#string STR_ROM_PCI_DRIVER_VER          #language eng "00.00"

#string STR_ROM_FORM                    #language eng "Option ROM Dispatch Policy"
#string STR_ROM_LIST_SUBTITLE           #language eng "Device Class Option ROM Dispatch Policy:"
#string STR_ROM_LIST_SUBTITLE1          #language eng "(Used when Group Policy set to 'Custom')"

#string STR_ROM_WARNING1 		        #language eng "WARNING: Changing Device(s) Option ROM"
#string STR_ROM_WARNING2                #language eng "dispatch policy may affect system’s ability" 
#string STR_ROM_WARNING3                #language eng "to post and/or boot!PROCEED WITH CAUTION!"


#string STR_ROM_VGA_SUPRESS_PROMPT      #language eng "Primary Video Ignore"
#string STR_ROM_VGA_SUPRESS_HELP        #language eng "If software will detect that due to the Policy settings, Option ROM of Primary Video Device will not dispatch, it will ignore this device policy settings, and restore it to 'Enable' automaticaly."
                                                             
#string STR_ROM_RESET_POLICY_PROMPT     #language eng "Restore if Failure"
#string STR_ROM_RESET_POLICY_HELP       #language eng "If system fails to boot and this option is set to 'Enabled', software will reset settings of this page as well as CSM page to its default values automatically."

#string STR_ROM_OPTION_HELP             #language eng "Enable or Disable Option ROM execution for selected Slot."
#string STR_ROM_ITEM_HELP_ONBOARD       #language eng "Onboard Device has:\n UEFI   [%s]\n Legacy [%s]\nEmbedded ROM(s).\nVIDx%X;DIDx%X\n@ s%d|Bx%X|Dx%X|Fx%X"
#string STR_ROM_ITEM_HELP_SLOT_HAVE     #language eng "Device on Slot has:\n UEFI   [%s]\n Legacy [%s]\nOption   ROM(s).\nVIDx%X;DIDx%X\n@ s%d|Bx%X|Dx%X|Fx%X"
#string STR_ROM_ITEM_HELP_SLOT_DONT     #language eng "Device on Slot does not have an Option ROM."
//#string STR_ROM_ITEM_HELP_LOCATION      #language eng "VID(x%X) DID(x%X)\n@ S%d|Bx%X|Dx%X|Fx%X"


//Default policy display strings...
#string STR_ROM_DEFAULT_POLICY_PROMPT1  #language eng "Device Group Default ROM Policy"
#string STR_ROM_DEFAULT_POLICY_PROMPT2  #language eng "(Selected at CSM Setup Page)  :" 
#string STR_ROM_DEFAULT_POLICY_PROMPT3  #language eng "(CSM not Active) - 'UEFI' used:" 

#string STR_ROM_NETWORK_CLASS           #language eng "Network Class"
#string STR_ROM_STORAGE_CLASS           #language eng "Mass Storage Class"
#string STR_ROM_DISPLAY_CLASS           #language eng "Display Class" 
#string STR_ROM_OTHER_CLASS             #language eng "Other Devices" 

#string STR_ROM_NETWORK_POLICY_UEFI     #language eng "Network Class      :  UEFI" 
#string STR_ROM_STORAGE_POLICY_UEFI	    #language eng "Mass Storage Class :  UEFI" 
#string STR_ROM_DISPLAY_POLICY_UEFI	    #language eng "Display Class      :  UEFI" 
#string STR_ROM_OTHER_POLICY_UEFI	    #language eng "Other Devices      :  UEFI" 

#string STR_ROM_NETWORK_POLICY_LEGACY   #language eng "Network Class      :  Legacy" 
#string STR_ROM_STORAGE_POLICY_LEGACY   #language eng "Mass Storage Class :  Legacy" 
#string STR_ROM_DISPLAY_POLICY_LEGACY   #language eng "Display Class      :  Legacy" 
#string STR_ROM_OTHER_POLICY_LEGACY     #language eng "Other Devices      :  Legacy" 

#string STR_ROM_NETWORK_POLICY_LEGACY   #language eng "Network Class      :  Legacy" 
#string STR_ROM_STORAGE_POLICY_LEGACY   #language eng "Mass Storage Class :  Legacy" 
#string STR_ROM_DISPLAY_POLICY_LEGACY   #language eng "Display Class      :  Legacy" 
#string STR_ROM_OTHER_POLICY_LEGACY     #language eng "Other Devices      :  Legacy" 

//----------------------------------------------------------------------
//Strings We are going to Assmble goto control and 
//PCI Device Subtitle messages. Needed to suport localization.
#string STR_DEVICE_STR                  #language eng "Device  "
#string STR_SLOT_STR                    #language eng "Slot"
#string STR_ONBOARD_STR                 #language eng "On Board"
#string STR_POPULATED_STR               #language eng "Occupied"
#string STR_EMPTY_STR                   #language eng "Empty   "
#string STR_NOT_PRESENT_STR             #language eng "NOT FOUND"
#string STR_DISABLE_STR                 #language eng "Disable"
#string STR_UEFI_STR                    #language eng "UEFI"
#string STR_LEGACY_STR                  #language eng "Legacy"
#string STR_CUSTOM_STR                  #language eng "Custom"

//----------------------------------------------------------------------
#string STR_ROM_HELP_NETWORK_BEHIND     #language eng "Network Device behind the bridge."
#string STR_ROM_HELP_STORAGE_BEHIND     #language eng "Mass Storage Device behind the bridge."
#string STR_ROM_HELP_DISPLAY_BEHIND     #language eng "Display Device behind the bridge."
#string STR_ROM_HELP_OTHER_BEHIND       #language eng "Other Device behind the bridge."

//----------------------------------------------------------------------
#string STR_PCI_CLAS_00_STR             #language eng "Old PCI Device"
#string STR_PCI_CLAS_01_STR             #language eng "Mass Storage Controller"
#string STR_PCI_CLAS_02_STR             #language eng "Network Controller"
#string STR_PCI_CLAS_03_STR             #language eng "Display Controller"
#string STR_PCI_CLAS_04_STR             #language eng "Multimedia Device"
#string STR_PCI_CLAS_05_STR             #language eng "Memory Controller"
#string STR_PCI_CLAS_06_STR             #language eng "Bridge Device"
#string STR_PCI_CLAS_07_STR             #language eng "Simple Comm. Controller"
#string STR_PCI_CLAS_08_STR             #language eng "Base System Peripherals"
#string STR_PCI_CLAS_09_STR             #language eng "Input Device"
#string STR_PCI_CLAS_0A_STR             #language eng "Docking Station"
#string STR_PCI_CLAS_0B_STR             #language eng "Processor"
#string STR_PCI_CLAS_0C_STR             #language eng "Serial Bus Controller"
#string STR_PCI_CLAS_0D_STR             #language eng "Wireless Controller"
#string STR_PCI_CLAS_0E_STR             #language eng "Intelligent I/O Controller"
#string STR_PCI_CLAS_0F_STR             #language eng "Satellite Comm. Controller"
#string STR_PCI_CLAS_10_STR             #language eng "En/Decryption Controller"
#string STR_PCI_CLAS_11_STR             #language eng "Data Acquisition Controller"
#string STR_PCI_CLAS_UNKNOWN_STR        #language eng "Unknown Class"

//----------------------------------------------------------------------

#string STR_ROM_OTHER_CLASS_HELP        #language eng "Determines OpROM execution policy for devices other than Network, Storage, or Video"
#string STR_ROM_DISPLAY_CLASS_HELP      #language eng "Controls the execution of UEFI and Legacy Video OpROM"
#string STR_ROM_STORAGE_CLASS_HELP      #language eng "Controls the execution of UEFI and Legacy Storage OpROM"
#string STR_ROM_NETWORK_CLASS_HELP      #language eng "Controls the execution of UEFI and Legacy Network OpROM"



//#string STR_PCI_DRIVER_VER              #language eng "00.00"

//#string STR_1G                          #language eng "1 G" 
//#string STR_1G                          #language eng "1 G" 
//#string STR_1G                          #language eng "1 G" 



//**********************************************************************
//**********************************************************************
//**                                                                  **
//**        (C)Copyright 1985-2016, American Megatrends, Inc.         **
//**                                                                  **
//**                       All Rights Reserved.                       **
//**                                                                  **
//**      5555 Oakbrook Parkway, Suite 200, Norcross, GA 30093        **
//**                                                                  **
//**                       Phone: (770)-246-8600                      **
//**                                                                  **
//**********************************************************************
//**********************************************************************